{
  "main-nav.link-a": "Services",
  "main-nav.link-b": "Projects",
  "main-nav.link-c": "About",
  "main-nav.link-d": "Contact",
  "lang-switcher-label": "Language",
  "theme-btn-light": "Light mode",
  "theme-btn-dark": "Dark mode",
  "main-loader-text": "Loading...",
  "projects-gif-alt": "Projects by freelance developer Manassés Ndombele",
  "main-copy.title": "Building detail-oriented projects ",
  "main-copy.title.strong": "designed to convert",
  "main-copy.description": "I don’t just write code — I dive into the details that make users naturally interact with what I create. Every color, position, image, and animation has a purpose. That’s how I deliver solutions that actually sell, giving you a final result you’ll be proud to call your own!",
  "main-copy.cta-btn": "Request a quote",
  "service-container.title": "What can I do for you?",
  "service-container.description": "Every idea can become code, and every code can turn into a market-ready solution. Here are some of the services I offer:",
  "service-container.subtitle-a": "Sales-focused websites",
  "service-container.description-a": "One of my key skills is creating landing pages and online stores focused on selling a product or service. These are usually designed with bold visuals tailored to the seller’s target audience.",
  "service-container.subtitle-b": "Branding websites",
  "service-container.description-b": "In response to the growing demand for websites that communicate a brand’s visual identity, I offer institutional website development. If you need a site that truly reflects your brand, this service is for you.",
  "service-container.subtitle-c": "Web systems",
  "service-container.description-c": "Few developers master design, security, and performance all at once. I specialize in functional web systems — whether for one specific feature or many — and can help you overcome this major challenge with quality solutions.",
  "service-container.subtitle-d": "Automations",
  "service-container.description-d": "Using Python, I create bots, API integrations, spreadsheet automation, and more — custom solutions to streamline your repetitive tasks. Just about anything can be automated to boost your business’s productivity and performance.",
  "skills-container.title": "My skills",
  "skills-container.description": "This is the part of my portfolio I update most proudly and frequently — because I believe in self-taught learning, and that using the best tools leads to the best results for you.",
  "skill-category.title": "Other technologies",
  "projects-container.title": "My projects",
  "projects-container.description": "Here are some real-world projects that showcase my skills. After all, seeing is believing.",
  "projectCard1": {
    "category1": "Sales website",
    "category2": "Landing page",
    "description": "This is a landing page for a weight loss info product called `Emagrecimento Sem Segredos`. It was created to showcase my frontend development and web design skills.",
    "imgAlt": "Example of a high-converting landing page"
  },
  "projectCard2": {
    "category1": "Branding website",
    "category2": "Corporate website",
    "category3": "Web application",
    "description": "This is a corporate website and also a web booking system built with PHP and other tools. It was developed for a fictional hotel chain named `EDEN Hotels`, located in Europe.",
    "imgAlt": "Example of a corporate branding website and hotel booking system"
  },
  "projectCard3": {
    "category1": "Sales website",
    "category2": "Online store",
    "description": "This is an online store currently under development. It focuses on the VR glasses niche and, for now, serves only as a demonstration of my frontend and web design skills — but it will soon be fully functional.",
    "imgAlt": "Example of a modern online store for VR glasses"
  },
  "projectCard4": {
    "category1": "Branding website",
    "category2": "Corporate website",
    "description": "This is a sample corporate website for a fictional consulting company. It serves as a demonstration of my frontend development and web design capabilities.",
    "imgAlt": "Example of a corporate branding website for a consulting firm"
  },
  "projectCard5": {
    "category1": "Others",
    "description": "This is an addiction quiz focused on compulsive behavior, based on data from the WHO. It was created for the Socorre.me platform by Daniel Santos.",
    "imgAlt": "Compulsive behavior addiction quiz for the Socorre.me platform"
  },
  "projectCard6": {
    "category1": "Web system",
    "category2": "Automations",
    "description": "This is a mini system for mass email sending using SMTP. It allows fast and free email delivery by using an app password to grant the site access to a sender email account.",
    "imgAlt": "Web automation system for email delivery"
  },
  "projectCard7": {
    "category1": "Sales website",
    "category2": "Landing page",
    "description": "This is a sample landing page created to simulate the sale of access to a course platform in the cryptocurrency niche, called `CriptoHacking`.",
    "imgAlt": "Example of a high-converting landing page"
  },
  "projectCard8": {
    "category1": "Branding website",
    "category2": "Corporate website",
    "description": "This is a corporate website for a fictional company offering digital marketing and software house services. It's designed to demonstrate my understanding of core web technologies (HTML, CSS, JS).",
    "imgAlt": "Example of a corporate branding website for a marketing company"
  },
  "projectCard9": {
    "category1": "Automations",
    "category2": "Others",
    "description": "This project is a cross-platform desktop app designed to generate nutritious recipes based on the nutrients and gram quantities selected by the user. The recipes are generated using the SponnacularAPI.",
    "imgAlt": "Automation and desktop app for diet planning"
  },
  "projectCard10": {
    "category1": "Automations",
    "category2": "Others",
    "description": "This is a cross-platform desktop application built to recommend movies based on genres the user is interested in. The recommendations are sent to the user via WhatsApp using a Bot.",
    "imgAlt": "Automation and desktop app for movie recommendations via WhatsApp"
  },
  "projectCard11": {
    "category1": "Other",
    "description": "This is my freelance portfolio, which you're currently browsing. It was carefully crafted to reflect not only my technical skills in web development but also my creative approach to building websites.",
    "imgAlt": "Freelance portfolio of developer Manassés Ndombele"
  },
  "project-card.btn-action": "Learn more",
  "projects-container.btn-action": "See all projects",
  "about-container.img-alt": "Manassés Ndombele freelance developer",
  "about-container.title": "About me",
  "about-container.description-a": "It all started back in 2019, when I followed my curiosity about computers. My original plan was to dive into cybersecurity — it seemed like the perfect fit. But then I hit a requirement: I had to learn how to code. That’s when I discovered an entirely new world — the logic, the creativity, and the thrill of bringing an idea to life on the screen.",
  "about-container.description-b": "What started as a requirement quickly became a passion. Since then, I haven’t looked back. I studied, experimented, ran into roadblocks, and built projects that took me down amazing paths: web development, automation, desktop and mobile apps... Today, I bring experience with many languages, frameworks, and tools — and an ever-growing drive to create powerful solutions. Coffee helps, sure — but what really fuels me is the passion for building things that work. If you also believe great ideas deserve great execution, we’ve already got something in common!",
  "contacts-container.social.title-a": "Social media",
  "contacts-container.social.title-b": "Email me at",
  "contacts-container.form.title": "Ready to bring your idea to life?",
  "contacts-container.form.description": "Fill out your details and tell me about your project. I’ll review everything carefully and get back to you with a quote as soon as possible. This is the first step toward turning your idea into a real solution.",
  "contacts-container.submit-msg.success": "Your request has been successfully submitted. Thank you very much for entrusting your project to me!",
  "contacts-container.submit-msg.error": "The form could not be submitted. This might be a temporary issue with the server. Please reload the page!",
  "contacts-container.form.placeholder-a": "Your name",
  "contacts-container.form.placeholder-b": "Contact method (email or WhatsApp)",
  "contacts-container.form.placeholder-c": "Project name",
  "contacts-container.form.placeholder-d": "Project domain or reference site",
  "contacts-container.form.placeholder-e": "Project description",
  "contacts-container.form.submit-btn": "Send",
  "footer.text": "2025 - Developed by Manassés Ndombele",
  "home-link-container.span": "Home",
  "projects-main-copy.title": "Explore projects",
  "projects-main-copy.description": "Feel free to explore, review, and access any of the projects available here — including their repositories on GitHub, under the MIT license.",
  "search-container.label": "What are you looking for today?",
  "search-container.option-a": "All projects",
  "search-container.option-b": "Sales websites",
  "search-container.option-c": "Branding websites",
  "search-container.option-d": "Web systems",
  "search-container.option-e": "Automations",
  "search-container.option-f": "Others",
  "modal-project.cta-a": "View repository",
  "modal-project.cta-b": "Visit project"
}
