{
  "main-nav.link-a": "Serviços",
  "main-nav.link-b": "Projetos",
  "main-nav.link-c": "Sobre",
  "main-nav.link-d": "Contatos",
  "lang-switcher-label": "Língua",
  "theme-btn-light": "Modo claro",
  "theme-btn-dark": "Modo escuro",
  "main-loader-text": "Carregando...",
  "projects-gif-alt": "Projetos do desenvolvedor freelancer Manassés Ndombele",
  "main-copy.title": "Criando projetos pensados no detalhe, ",
  "main-copy.title.strong": "criado para vender",
  "main-copy.description": "Mais do que escrever código, eu mergulho nos detalhes que levam os usuários a interagirem de forma intuitiva com meus projetos. Cada cor, posição, imagem, animação tem um porquê! Desta forma eu crio soluções vendáveis para que você possa ter um resultado final que você possa chamar orgulhosamente de seu!",
  "main-copy.cta-btn": "Pedir orçamento",
  "service-container.title": "O que eu posso fazer por você?",
  "service-container.description": "Toda a idéia pode ser transformada em um código, e todo código pode ser transformado em uma solução para o mercado! Eis algumas das soluções que posso prover:",
  "service-container.subtitle-a": "Site de vendas",
  "service-container.description-a": "Uma das minhas especialidades é o desenvolvimento de páginas de vendas e lojas online onde o foco principal é a venda de um produto ou serviço, geralmente apresentados com um design arrojado e modelados para o público alvo do vendedor.",
  "service-container.subtitle-b": "Site para branding",
  "service-container.description-b": "Como resposta a alta demanda por sites que têm o objetivo de passar uma mensagem consistente com a identidade visual de uma marca trabalho na prestação do serviço de criação de sites institucionais! Se você deseja um site que reflita a sua marca este serviço é perfeito para si.",
  "service-container.subtitle-c": "Sistemas web",
  "service-container.description-c": "Poucos desenvolvedores conseguem alcançar a excelência em design, segurança e eficiência em sistemas web, sites que têm uma funcionalidade em específica ou diversas são o desafio que superei e posso diligentemente sarar essa grande dor nesse mercado adequadamente.",
  "service-container.subtitle-d": "Automações",
  "service-container.description-d": "Em especial através da linguagem Python sou capaz de criar bots, fazer integrações com APIs, manipular planilhas do Excel, etc. Para criar uma solução bem específica para resolver tarefas repetitivas do seu dia à dia de trabalho. Toda tarefa pode ser automatizada para aumentar a produtividade e performance do seu negócio.",
  "skills-container.title": "Minhas habilidades",
  "skills-container.description": "Esta é a área do portfólio que venho atualizar a todo o momento com o maior orgulho e prazer do mundo, porque acredito no aprendizado autodidata e que o uso das melhores ferramentas têm como consequência os melhores resultados para si.",
  "skill-category.title": "Outras tecnologias",
  "projects-container.title": "Meus projetos",
  "projects-container.description": "Aqui estão alguns projetos que comprovam minhas habilidades na prática pois como diz o ditado é necessário ver para crer.",
  "projectCard1": {
    "category1": "Site de vendas",
    "category2": "Landing page",
    "description": "Esta é uma landing page para um infoproduto no nicho de emagrecimento denominado `Emagrecimento Sem Segredos`, foi criado para demonstrar minhas habilidades em desenvolvimento frontend e webdesign.",
    "imgAlt": "Exemplo de landing page de alta conversão"
  },
  "projectCard2": {
    "category1": "Site para branding",
    "category2": "Site institucional",
    "category3": "Sistema web",
    "description": "Este é um site institucional e também um sistema web de reservas criado com PHP e outras ferramentas, ele foi desenvolvido para um hotel fictício denominado `EDEN Hotels` que se situa na Europa.",
    "imgAlt": "Exemplo de site institucional para branding de uma rede de hotéis e sistema web de reservas"
  },
  "projectCard3": {
    "category1": "Site de vendas",
    "category2": "Loja online",
    "description": "Esta é uma loja online ainda em andamento, ela está focada no nicho de óculos vr, e por enquanto é apenas uma demonstração das minhas habilidades em desenvolvimento frontend e webdesign mas brevemente estará 100% concluída e funcional.",
    "imgAlt": "Exemplo de loja online moderna de óculos VR"
  },
  "projectCard4": {
    "category1": "Site para branding",
    "category2": "Site institucional",
    "description": "Este é um site institucional de exemplo, no caso para uma empresa fictícia que presta serviços de consultoria, isto é apenas uma demonstração das minhas habilidades em desenvolvimento frontend e webdesign.",
    "imgAlt": "Exemplo de site institucional para branding de empresa de consultoria"
  },
  "projectCard5": {
    "category1": "Outros",
    "description": "Este é um quiz para teste de vício em compulsão baseado em dados da OMS criado para ser adicionada a plataforma Socorre.me de Daniel Santos.",
    "imgAlt": "Quiz para teste de vício em compulsão da Socorre.me"
  },
  "projectCard6": {
    "category1": "Sistema web",
    "category2": "Automações",
    "description": "Este é um mini sistema de envio de emails em massa usando SMTP para enviar emails de forma gratuita e rápida através de uma senha de aplicativo para que o site tenha acesso a uma conta de email de remetente.",
    "imgAlt": "Sistema web de automação de envio de emails"
  },
  "projectCard7": {
    "category1": "Site de vendas",
    "category2": "Landing page",
    "description": "Esta é uma landing page de exemplo para simular a venda do acesso a uma plataforma de cursos no nicho de criptomoedas denominada `CriptoHacking`.",
    "imgAlt": "Exemplo de landing page de alta conversão"
  },
  "projectCard8": {
    "category1": "Site para branding",
    "category2": "Site institucional",
    "description": "Este é um site institucional criado para uma fictícia empresa prestadora de serviçõs de marketing digital e software house, é apenas para demonstrar meus conhecimentos na base da web (HTML, CSS, JS).",
    "imgAlt": "Exemplo de site institucional para branding de empresa de marketing"
  },
  "projectCard9": {
    "category1": "Automações",
    "category2": "Outros",
    "description": "Este projeto é um programa desktop multiplataforma com objetivo de gerar receitas nutritivas para o usuário com base nos nutrientes e a quantidade em gramas selecionadas pelo usuário, as receitas são geradas através da SponnacularAPI.",
    "imgAlt": "Automação e programa desktop para planejamento de dietas"
  },
  "projectCard10": {
    "category1": "Automações",
    "category2": "Outros",
    "description": "Este é um programa desktop multiplataforma criado com o objetivo de gerar recomendações de filmes baseado em dados recolhidos sobre os gêneros de filmes de interesse do usuário, essas mesmas recomendações são enviadas para o whatsapp do usuário através de um Bot.",
    "imgAlt": "Automação e programa desktop para recomendação de filmes pelo Whatsapp"
  },
  "projectCard11": {
    "category1": "Outros",
    "description": "Este é meu portfólio freelancer que estás navegando nele criado de forma detalhista com o objetivo de passar examente a imagem de que crio meus sites com conhecimento técnico mas além disso muita criatividade.",
    "imgAlt": "Portfólio freelancer do desenvolvedor Manassés Ndombele"
  },
  "project-card.btn-action": "Saiba mais",
  "projects-container.btn-action": "Ver todos projetos",
  "about-container.img-alt": "Manassés Ndombele desenvolvedor freelancer",
  "about-container.title": "Sobre mim",
  "about-container.description-a": "Tudo começou em 2019, quando fui atrás daquilo que me fascinava: computadores. Meu plano incial era entrar para a área de segurança da informação, parecia o caminho perfeito para alguém curioso. Mas aí veio um detalhe: eu precisava aprender a programar. Foi nesse momento que descubri um novo universo. A lógica por trás do código, a liberdade de criar do zero, a sensação de ver uma ideia ganhar forma na tela...",
  "about-container.description-b": "O que era só um requesito virou paixão. De lá pra cá, não parei mais. Estudei, testei, quebrei a cabeça várias vezes, e construí projetos que me levaram por caminhos incríveis: desenvolvimento web, automações, desktop e mobile... Hoje tenho a bagagem cheia de linguagens, frameworks, bibliotecas, etc. E um entusiasmo que só cresce. O café ajuda, claro, mas o que me move de verdade é a vontade de criar soluções eficazes. Se você também acredita que boas ideias merecem ser bem executadas, nós temos algo em comum!",
  "contacts-container.social.title-a": "Redes sociais",
  "contacts-container.social.title-b": "Envie email para",
  "contacts-container.form.title": "Vamos tirar a sua ideia do papel?",
  "contacts-container.form.description": "Preencha os seus dados e descreva o seu projeto. Vou analisar tudo com atenção e te enviar um orçamento o quanto antes, através do contacto informado. Esse é o primeiro passo para transformar sua ideia em uma solução real.",
  "contacts-container.submit-msg.success": "O seu pedido foi enviado com sucesso. Muito obrigado por confiar seu projeto a mim!",
  "contacts-container.submit-msg.error": "Não foi possível enviar o formulário! Talvez seja um problema temporário no servidor. Recarregue a página!",
  "contacts-container.form.placeholder-a": "Seu nome",
  "contacts-container.form.placeholder-b": "Forma de contacto (email ou whatsapp)",
  "contacts-container.form.placeholder-c": "Nome do projeto",
  "contacts-container.form.placeholder-d": "Domínio do projeto ou de um modelo",
  "contacts-container.form.placeholder-e": "Descrição do projeto",
  "contacts-container.form.submit-btn": "Enviar",
  "footer.text": "2025 - Desenvolvido por Manassés Ndombele",
  "home-link-container.span": "Início",
  "projects-main-copy.title": "Explorar projetos",
  "projects-main-copy.description": "Tenha a total liberdade para analisar, criticar e acessar os projetos disponíveis para si bem como seus repositórios disponíveis no Github sob licença MIT.",
  "search-container.label": "O que está procurando hoje?",
  "search-container.option-a": "Todos projetos",
  "search-container.option-b": "Site de vendas",
  "search-container.option-c": "Site para branding",
  "search-container.option-d": "Sistemas web",
  "search-container.option-e": "Automações",
  "search-container.option-f": "Outros",
  "modal-project.cta-a": "Ver repositório",
  "modal-project.cta-b": "Acessar projeto"
}
